const codes = {
  '0': '0', // Липсва информация
  '1': '0210', // За маркиране на землищни, общински и обласни граници
  '2': '0210-1', // Железобетонни колове или тръби, поставени в земята
  '3': '0210-2', // Железобетонни колове или тръби с бетонова основа
  '4': '0220', // За маркиране на граници на поземлени имоти
  '5': '0220-1', // Знаци от камък и бетон
  '6': '0220-1-1', // Камък от твърда порода
  '7': '0220-1-2', // Метален прът с бетонирана горна част
  '8': '0220-1-3', // Бетоново блокче с метален прът или тръба
  '9': '0220-1-4', // Железобетонен или железен кол
  '10': '0220-2', // Знаци от други материали
  '11': '0220-2-1', // Тръби от твърда пластмаса
  '12': '0220-2-2', // Маркиране с жълта боя ъглите на масивни съоражения
  '13': '0220-2-3', // Знак от некорозираща алуминиева сплав
  '14': '0220-2-4', // Знак от компресиран полиетилен
  '15': '0220-2-5', // Знак от полимерен бетон
  '16': '0220-2-6', // Маркиращ болт
  '17': '0220-2-7', // Маркиращ пирон
  '18': '0220-3' // Маркиращи табели
};

export default function(code) {
  return codes[code];
}
