const codes = {
  '1': 'Паянтова',
  '2': 'Полумасивна',
  '3': 'Масивна с дървен гредоред',
  '4': 'Масивна с железен гредоред',
  '5': 'Масивна с частични стоманобетонни елементи',
  '6': 'Масивна с носещи стени и стоманобетонни подови конструкции',
  '7': 'Масивна - панелна',
  '8': "Масивна - по метода 'Едроплощен кофраж'",
  '9': "Масивна - по метода 'Пълзящ кофраж'",
  '10': 'Масивна - скелетни и рамови стоманобетонни конструкции',
  '11': "Масивна - по метода 'Пакетно повдигани плочи'",
  '12': 'Масивна - скелетно безгредова',
  '13': "Масивна - по метода 'Тунел-кофраж'",
  '14': 'Метална (стоманена)',
  '15': 'Уникална',
  '16': 'Специална',
  '17': 'Друг вид'
};

export default function(code) {
  return codes[code];
}
