const codes = {
  '0': 'Няма информация',
  '1': 'Жилищни',
  '2': 'Производствено-складови',
  '3': 'Паркове и зелени площи',
  '4': 'За спорт и рекреация',
  '5': 'Обществено обслужване',
  '6': 'Транспортна инфраструктура',
  '7': 'Инженерно-техническа инфраструктура и комунално обслужване',
  '8': 'Културно-историческо наследство',
  '9': 'Курортни',
  '10': 'Със специално предназначение',
  '11': 'С друго предназначение',
  '12': 'Със смесено предназначение',
  '13': 'Обществени частни мероприятия'
};

export default function(code) {
  return codes[code];
}
