const codes = {
    "A": "Берковица",
    "B": "Благоевград",
    "C": "Бургас",
    "E": "Варна",
    "F": "Велико Търново",
    "G": "Кърджали",
    "H": "Кюстендил",
    "K": "Ловеч",
    "L": "Пазарджик",
    "M": "Пловдив",
    "N": "Русе",
    "P": "Сливен",
    "Q": "Смолян",
    "R": "София",
    "S": "Стара Загора",
    "T": "Шумен",
    "V": "",
    "U": "Природни паркове",
    "W": "Учебни стопанства",
    "X": "",
    "Y": "Национални паркове",
    "Z": "ГС със специален статут"
};

export default function(code) {
  return codes[code];
}
