const codes = {
  '0': 'Няма данни',
  '1': 'Държавна публична',
  '2': 'Държавна частна',
  '3': 'Общинска публична',
  '4': 'Общинска частна',
  '5': 'Частна',
  '6': 'Частна кооперативна',
  '7': 'Частна обществени организации',
  '8': 'Частна чужди физически и юридически лица',
  '9': 'Частна международни организации',
  '10': 'Частна религиозни организации',
  '11': 'Съсобственост   ',
  '12': 'Изключителна държавна собственост',
  '97': 'стопанисвана от държавата по чл.14а от ЗВСГЗГФ',
  '98': 'държавна собственост по чл.6 от ЗВСГЗГФ',
  '99': 'Стопанисвано от общината'
};

export default function(code) {
  return codes[code];
}
