const codes = {
  '0': 'Няма данни',
  '1': 'Право на собственост',
  '2': 'Право на ползване',
  '3': 'Право на строеж',
  '4': 'Право на пристрояване',
  '5': 'Право на надстрояване',
  '6': 'Концесия',
  '7': 'Аренда',
  '8': 'Сервитут',
  '9': 'Право на преминаване',
  '10': 'Наем',
  '11': 'Право на ползуване - чл.56 от ЗС',
  '12': 'Право на строеж - чл.63 от ЗС',
  '13': 'Прекратяване право на ползуване',
  '14': 'Прекратяване право на строеж',
  '15': 'Право на ползуване - чл.16 от ЗГ'
};

export default function(code) {
  return codes[code];
}
