const codes = {
  '0': 'по ЗСПЗЗ или ЗВСГЗГФ',
  '1': 'Делба',
  '2': 'покупко-продажба',
  '3': 'Замяна',
  '4': 'Прехвърляне',
  '5': 'Дарение',
  '6': 'апорт в дружество',
  '7': 'отказ от собственост',
  '8': 'Наследство',
  '9': 'по давност',
  '10': 'разпореждане с ДПФ',
  '11': 'придобиване на земеделски земи по чл.27б, ал.4 от ППЗСПЗЗ',
  '12': 'придобиване на гори и земи от ДГФ по чл.7, ал.3 от ЗГ',
  '13': 'отчужд.за държ.нужди',
  '14': 'отчужд.за общ. нужди'
};

export default function(code) {
  return codes[code];
}
