const codes = {
  '500': 'Жилище, апартамент',
  '510': 'Ателие за творческа дейност',
  '520': 'Кабинет за творческа дейност',
  '530': 'Гараж в сграда',
  '540': 'Инфраструктурен обект в сграда',
  '550': 'За търговска дейност',
  '560': 'За обслужваща дейност за битови услуги',
  '570': 'За обществено хранене',
  '580': 'За детско заведение',
  '590': 'За здравни и социални услуги',
  '600': 'За културна и обществена дейност',
  '610': 'За учебна дейност',
  '620': 'За научна и проектантска дейност',
  '630': 'За култова и ритуална дейност',
  '640': 'За спортна и развлекателна дейност',
  '650': 'За делова и административна дейност',
  '660': 'За офис',
  '670': 'За склад',
  '680': 'Обекти със специално предназначение',
  '690': 'Друг вид самостоятелен обект в сграда'
};

export default function(code) {
  return codes[code];
}
